{
    "information":[
        {
            "id": 1,
            "icon": "avvic.png",
            "title": "AVVIC CONSULT",
            "text": "Avvic Consults operated a nimble, non-incorporated, operational model for over half a decade. Business growth and increasing client demand necessitated the change of its functional business model and it was consequently incorporated in 2021. The subsidiary provides a comprehensive suite of business solutions designed to unlock client’s full business value by adopting a 360-degree approach to align business strategies effectively, improve efficiency, and create value."
        },
        {
            "id": 2,
            "icon": "avvic.png",
            "title": "AVVIC CONNECT",
            "text": "The organization’s commitment to continuously deliver creative, innovative, and value-driven business and financial solutions birthed the incorporation of Avvic Connect in 2021. This subsidiary is an integrated financial consultancy and advisory services company. It offers unbundled financial consultancy services through strategic inter-industry partnerships, fitted to meet specific client needs in different sectors."
        },
        {
            "id": 3,
            "icon": "avvic.png",
            "title": "AVVIC TECH",
            "text": "Avvic Tech evolved from an in-house IT solutions entity, which provided critical IT backbone for the Group, to an independent subsidiary incorporated to extend its unique services to a broader client base. The subsidiary is a value-driven team of talented, highly skilled, creative individuals who drive the organisation’s IT solutions suite adapted for specific client projects and businesses."
        },
        {
            "id": 4,
            "icon": "avvic.png",
            "title": "AVVIC HOMES",
            "text": "Avvic Homes was incorporated to leverage the Group’s cutting-edge technological, financial, and business solutions to deliver competitive real estate value to clients. The company’s market presence provides real estate industry access to a wide stratum of sophisticated investors and consumers. We partner with key players in the industry to bridge critical funding gaps, provide linkages and create new opportunities that guarantee excellent returns on investment."
        },
        {
            "id": 5,
            "icon": "avvic.png",
            "title": "AVVIC AGRO",
            "text": "In the Group’s quest for active engagement in the identification, development, and deployment of right-fit technologies for farms and other operators in the agricultural space, Avvic Agro evolved from a field management team to a farm IT solutions entity providing critical technology for farmers and agricultural processes. Avvic Agro is firmly focussed on precision agriculture, the use of emerging technologies to enhance farmer’s capacity to manage inventory, monitor yield, control pests, optimize fertilizer application, manage farm finances, and efficiently utilize available farm resources."
        }
    ]
}